Repository: mzkzk/watertracker
Catalog: lib/l10n/intl_*.arb
Languages: ar

# appTitle
source: Water Tracker
ar: متتبع استهلاك المياه

# dashboardTitle
source: Water Consumption Tracker
ar: متتبع استهلاك المياه

source: Add Consumption
ar: إضافة استهلاك

source: Small Cup
ar: كوب صغير

source: Large Cup
ar: كوب كبير

source: Small Bottle
ar: زجاجة صغيرة

source: Large Bottle
ar: زجاجة كبيرة

# todayLog
source: Today's Log
ar: سجل اليوم

# noRecordsToday
source: No records for today
ar: لا توجد سجلات لهذا اليوم

source: Settings
ar: الإعدادات

# dailyGoal
source: Daily Goal (ml)
ar: الهدف اليومي (مل)

# enterDailyGoal
source: Enter your daily goal in milliliters
ar: أدخل هدفك اليومي بالملليلتر

source: Save Goal
ar: حفظ الهدف

# goalUpdated
source: Daily goal updated
ar: تم تحديث الهدف اليومي

source: Reminders
ar: التذكيرات

# receiveReminders
source: Receive reminders to drink water throughout the day
ar: تلقي تذكيرات لشرب الماء خلال اليوم

source: Consumption History
ar: سجل الاستهلاك

# noHistory
source: No records found
ar: لا توجد سجلات مسجلة

source: Save
ar: حفظ

source: Language
ar: اللغة

source: Theme
ar: المظهر

source: Light
ar: فاتح

source: Dark
ar: داكن

# system
source: System Default
ar: افتراضي النظام

source: Arabic
ar: العربية

source: English
ar: الإنجليزية

source: Main
ar: الرئيسية

source: History
ar: السجل

source: Settings
ar: الإعدادات

# resetTodayConfirm
source: Are you sure you want to delete today's consumption records? This cannot be undone.
ar: هل أنت متأكد أنك تريد حذف سجلات استهلاك اليوم؟ لا يمكن التراجع عن هذا الإجراء.

# resetTodaySuccess
source: Today's records have been reset.
ar: تمت إعادة تعيين سجلات اليوم.
